99_cats/app/controllers/cat_rental_requests_controller.rb

INSERT INTO "cat_rental_requests" ("cat_id", "start_date", "end_date", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["cat_id", 1], ["start_date", "2022-11-17"], ["end_date", "2022-11-25"], ["status", "PENDING"], ["created_at", "2022-11-15 01:26:42.355959"], ["updated_at", "2022-11-15 01:26:42.355959"]]
---
  def create
    @rental_request = CatRentalRequest.new(cat_rental_request_params)
    if @rental_request.save