99_cats/app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats"
---
  def index
    @cats = Cat.all

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def show
    @cat = Cat.find(params[:id])

INSERT INTO "cats" ("birth_date", "color", "name", "sex", "description", "created_at", "updated_at", "owner_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
  def create
    @cat = Cat.new(cat_params)
    @cat.owner_id = current_user.id
    if @cat.save

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @cat = Cat.find(params[:id])

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def update
    @cat = Cat.find(params[:id])