99_cats/app/controllers/users_controller.rb

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "willam"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"], ["created_at", "2022-11-14 23:25:02.843326"], ["updated_at", "2022-11-14 23:25:02.843326"]]
---
  def create
    @user = User.new(user_params)
    @user.password = params[:user][:password]
    @user.reset_session_token!

    if @user.save