99_cats/app/models/user.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "willy"], ["LIMIT", 1]]
---
  def self.find_by_credentials(username, password)

    user = User.find_by(username: username)

INSERT INTO "users" ("username", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "sdfa"], ["password_digest", "[FILTERED]"], ["session_token", "[FILTERED]"], ["created_at", "2022-11-14 23:33:31.280695"], ["updated_at", "2022-11-14 23:33:31.280695"]]
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "[FILTERED]"], ["updated_at", "2022-11-14 23:34:22.197894"], ["id", 4]]
---
  def reset_session_token
    self.session_token = generate_unique_session_token
    self.save!

SELECT 1 AS one FROM "users" WHERE "users"."session_token" = $1 LIMIT $2  [["session_token", "[FILTERED]"], ["LIMIT", 1]]
---
  def generate_unique_session_token
    loop do
      token = SecureRandom::urlsafe_base64(16)
      return token unless User.exists?(session_token: token)