99_cats/app/views/cats/show.html.erb

  <h1>Rental Requests</h1>
  <% if @cat.rental_requests.empty? %>
---
SELECT 1 AS one FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 LIMIT $2  [["cat_id", 1], ["LIMIT", 1]]

      <% if @cat.owner_id == current_user.id %>
        <% @cat.rental_requests.order('start_date').each do |req| %>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY start_date  [["cat_id", 1]]